DL8NCI/stm32f411re_test_300/Test300/Src/main.c
/**
  ******************************************************************************
  * File Name          : main.c
  * Description        : Main program body
  ******************************************************************************
  ** This notice applies to any and all portions of this file
  * that are not between comment pairs USER CODE BEGIN and
  * USER CODE END. Other portions of this file, whether 
  * inserted by the user or by software development tools
  * are owned by their respective copyright owners.
  *
  * COPYRIGHT(c) 2017 STMicroelectronics
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32f4xx_hal.h"

/* USER CODE BEGIN Includes */
#include "math.h"
#include  <sys/unistd.h>
#include <errno.h>
#include "StdIoConnector.h"
#include "Statistics.h"
#include "ArduinoPins.h"
#include "DataAquisition.h"
#include "VT100.h"


/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/
ADC_HandleTypeDef hadc1;
DMA_HandleTypeDef hdma_adc1;

I2C_HandleTypeDef hi2c1;

SPI_HandleTypeDef hspi2;

TIM_HandleTypeDef htim2;

UART_HandleTypeDef huart1;
UART_HandleTypeDef huart2;
DMA_HandleTypeDef hdma_usart2_tx;

/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/
uint8_t spi_out[12] = { 0x06, 0x00, 0x00,  0x06, 0x40, 0x00,  0x06, 0x80, 0x00,  0x06, 0xc0, 0x00}; // ch0-ch3 in single ended mode
uint8_t spi_in[12];

double tAmb = 25.0;		// Umgebungstemperatur
double uSupp5 = 5.0;	// Versorgungsspannung 5.0 V

struct TDAQU_HIH8000_result hih8000_result;
HAL_StatusTypeDef hih8000_status;

volatile uint32_t counter_2_1 = 0; // counter 2, channel 1
volatile uint8_t  trigger_detected = 0;

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_USART2_UART_Init(void);
static void MX_ADC1_Init(void);
static void MX_SPI2_Init(void);
static void MX_I2C1_Init(void);
static void MX_TIM2_Init(void);
static void MX_USART1_UART_Init(void);

/* USER CODE BEGIN PFP */
/* Private function prototypes -----------------------------------------------*/

/* USER CODE END PFP */

/* USER CODE BEGIN 0 */

/* USER CODE END 0 */

int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration----------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_USART2_UART_Init();
  MX_ADC1_Init();
  MX_SPI2_Init();
  MX_I2C1_Init();
  MX_TIM2_Init();
  MX_USART1_UART_Init();

  /* USER CODE BEGIN 2 */


  GPIO_InitTypeDef itd;

  // some common setting for output pins:
  itd.Mode = GPIO_MODE_OUTPUT_PP;
  itd.Pull = GPIO_NOPULL;
  itd.Speed = GPIO_SPEED_HIGH;

  // LED
  itd.Pin = LED_PIN;
  HAL_GPIO_Init(LED_PORT,&itd);

  // PB2: !CS for MCP3204 (12 bit ADC)
  itd.Pin = CS_3204_PIN;
  HAL_GPIO_Init(CS_3204_PORT,&itd);
  // deselect MCP3204
  HAL_GPIO_WritePin(CS_3204_PORT,CS_3204_PIN,GPIO_PIN_SET);

  // some common settings for input pins
  itd.Mode = GPIO_MODE_INPUT;
  itd.Pull = GPIO_NOPULL;
  itd.Speed = GPIO_SPEED_HIGH;

  // User-Key
  itd.Pin = USER_KEY_PIN;
  HAL_GPIO_Init(USER_KEY_PORT,&itd);


  STDIOC_init(&huart2,&hdma_usart2_tx);

  VT100EraseScreen();
  VT100CursorHome();

  printf("The quick brown fox jumps over the lazy dog back\r\n");

/* Pinbelegung
 *
 * Funktion   Arduino           morpho
 * IN0:	PA0 - CN8-1 (A0)		CN7-28 (PA0)
 * IN1:	PA1 - CN8-2 (A1)		CN7-30 (PA1)
 * IN4:	PA4 - CN8-3 (A2)		CN7-32 (PA4)
 * IN5: PA5 - CN5-6 (D13)		CN10-11 (PA5)
 * IN6: PA6 - CN5-5 (D12)		CN10-13 (PA6)
 * IN7:	PA7 - CN5-4 (D11)		CN10-15 (PA7)
 * IN8:	PB0 - CN8-4 (A3)		CN7-34 (PB0)
 * IN9: PB1						CN10-24 (PB1)
 * IN10:PC0 - CN8-6 (A5)		CN7-38 (PC0/PB8)
 * IN11:PC1 - CN8-5 (A4)		CN7-36 (PC1/PB9)
 * IN12:PC2						CN7-35 (PC2)
 * IN13:PC3						CN7-37 (PC3)
 * IN14:PC4						CN10-34 (PC4)
 * IN15:PC5						CN10-6 (PC5)
 *
 * Project Setup: http://www.openstm32.org/Importing+a+STCubeMX+generated+project
 *
 */

  TStat st[N_CHANNELS];
  TStat st3204[4];
  uint8_t row;


  /* USER CODE END 2 */

