DL8NCI/stm32f411re_test_300/Test300/Src/main.c
  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
	  int i;

	  GPIO_PinState x = HAL_GPIO_ReadPin(USER_KEY_PORT,USER_KEY_PIN);
//	  HAL_GPIO_WritePin(GPIOA,GPIO_PIN_5,x);
//	  HAL_GPIO_TogglePin(LED_PORT,LED_PIN);

	  hih8000_status = DAQU_start_HIH8000(&hi2c1);

	  HAL_StatusTypeDef rc = DAQU_startADC(&hadc1, N_ITERATIONS, N_CHANNELS, st);
	  if (rc!=0) DAQU_printErrorInfo(rc);

	  for(i=0; i<4; i++) STAT_init(&st3204[i]);
	  // select MCP3204, external ADC
	  for (uint16_t i_iter=0; i_iter<N_ITERATIONS; i_iter++) {
		  for (i=0; i<4; i++) {
			  HAL_GPIO_WritePin(CS_3204_PORT,CS_3204_PIN,GPIO_PIN_RESET);
			  HAL_StatusTypeDef rc1 = HAL_SPI_TransmitReceive(&hspi2, &spi_out[3*i], &spi_in[3*i], 3, 100);
			  HAL_GPIO_WritePin(CS_3204_PORT,CS_3204_PIN,GPIO_PIN_SET);
			  if (rc==HAL_OK) {
				  uint16_t y = ((((uint16_t)spi_in[1+3*i])<<8)|spi_in[2+3*i]) & 0x0fff;
				  STAT_add(&st3204[i],y);
			  	  }
			  else DAQU_printErrorInfo(rc1);
		  	  }
	  	  }


	  if (hih8000_status==HAL_OK) {
		  hih8000_status = DAQU_read_HIH8000(&hi2c1,&hih8000_result);
	  	  }

	  row = 1;
	  VT100CursorGoto(row,1);
	  printf("32F411 - ch0 - 1.22 V:");
	  VT100CursorGoto(row,25);
	  STAT_print(&st[0]);						// STM32F411re - ch0 - cnts
	  VT100CursorGoto(row,50);
	  STAT_printVolt(&st[0],3.3,4096);			// STM32F411re - ch0 - Volt

	  row++;
	  VT100CursorGoto(row,1);
	  printf("3204   - ch0 - 1.22 V:");
	  VT100CursorGoto(row,25);
	  STAT_print(&st3204[0]);					// MCP3204     - ch0 - cnts
	  VT100CursorGoto(row,50);
	  STAT_printVolt(&st3204[0],3.0,4096);		// MCP3204     - ch0 - Volt


	  row++;
	  VT100CursorGoto(row,1);
	  printf("32F411 - ch1 - 3.0 V:");
	  VT100CursorGoto(row,25);
	  STAT_print(&st[1]);						// STM32F411re - ch1 - cnts (gemessene Referenz vom MCP3204)
	  VT100CursorGoto(row,50);
	  STAT_printVolt(&st[1],3.3,4096);			// STM32F411re - ch1 - Volt (gemessene Referenz vom MCP3204)

	  row++;
	  VT100CursorGoto(row,1);
	  printf("3204   - ch2 - 5 V:");
	  VT100CursorGoto(row,25);
	  STAT_print(&st3204[2]);					// MCP3204     - ch2 - cnts - 5 V
	  VT100CursorGoto(row,50);
	  uSupp5 = STAT_printVolt(&st3204[2],3.0*8.0/4.7,4096);		// MCP3204     - ch2 - Volt

	  row += 2;
	  VT100CursorGoto(row,1);
	  printf("32F411 - ch4:");
	  VT100CursorGoto(row,25);
	  STAT_print(&st[2]);						// STM32F411re - ch4 - cnts
	  VT100CursorGoto(row,50);
	  STAT_printVolt(&st[2],3.3,4096);			// STM32F411re - ch4 - Volt

	  row++;
	  VT100CursorGoto(row,1);
	  printf("32F411 - ch4 - RH:");
	  VT100CursorGoto(row,50);
	  STAT_printRH(&st[2], 3.3, uSupp5, tAmb);		// STM32F411re - ch4 - RH (via HIH4000)

	  row++;
	  VT100CursorGoto(row,1);
	  printf("3204   - ch3:");
	  VT100CursorGoto(row,25);
	  STAT_print(&st3204[3]);					// MCP3204     - ch3 - cnts - 5 V
	  VT100CursorGoto(row,50);
	  STAT_printVolt(&st3204[3],3.0,4096);		// MCP3204     - ch3 - Volt

	  row++;
	  VT100CursorGoto(row,1);
	  printf("3204   - ch3 - RH:");
	  VT100CursorGoto(row,50);
	  STAT_printRH(&st3204[3], 3.0, uSupp5, tAmb);		// MCP3204     - ch3 - RH (via HIH4000)

/* irgendwie tut der nicht
	  row++;
	  VT100CursorGoto(row,1);
	  printf("32F411 - ch5 - 3.3V:");
	  VT100CursorGoto(row,25);
	  STAT_print(&st[3]);						// STM32F411re - ch5 - cnts
	  VT100CursorGoto(row,50);
	  STAT_printVolt(&st[3],3.3,4096);			// STM32F411re - ch5 - Volt
*/

	  row++;
	  VT100CursorGoto(row,1);
	  printf("32F411 - ch6:");
	  VT100CursorGoto(row,25);
	  STAT_print(&st[4]);						// STM32F411re - ch6 - cnts
	  VT100CursorGoto(row,50);
	  STAT_printVolt(&st[4],3.3,4096);			// STM32F411re - ch6 - Volt

	  row++;
	  VT100CursorGoto(row,1);
	  printf("32F411 - ch6 - LDR:");
	  VT100CursorGoto(row,50);
	  STAT_printLux(&st[4],uSupp5);				// STM32F411re - ch6 - LDR

	  row++;
	  VT100CursorGoto(row,1);
	  printf("32F411 - ch7 - 3.3 V");
	  VT100CursorGoto(row,25);
	  STAT_print(&st[5]);						// STM32F411re - ch7 - cnts
	  VT100CursorGoto(row,50);
	  STAT_printVolt(&st[5],3.3,4096);			// STM32F411re - ch7 - Volt
/*
	  row++;
	  VT100CursorGoto(row,1);
	  printf("32F411 - ch8:");
	  VT100CursorGoto(row,25);
	  STAT_print(&st[6]);						// STM32F411re - ch8 - cnts
	  VT100CursorGoto(row,50);
	  STAT_printVolt(&st[6],3.3,4096);			// STM32F411re - ch8 - Volt

	  row++;
	  VT100CursorGoto(row,1);
	  printf("32F411 - ch10:");
	  VT100CursorGoto(row,25);
	  STAT_print(&st[7]);						// STM32F411re - ch10 - cnts
	  VT100CursorGoto(row,50);
	  STAT_printVolt(&st[7],3.3,4096);			// STM32F411re - ch10 - Volt

	  row++;
	  VT100CursorGoto(row,1);
	  printf("32F411 - ch11:");
	  VT100CursorGoto(row,25);
	  STAT_print(&st[8]);						// STM32F411re - ch11 - cnts
	  VT100CursorGoto(row,50);
	  STAT_printVolt(&st[8],3.3,4096);			// STM32F411re - ch11 - Volt
*/

	  row++;
	  VT100CursorGoto(row,1);
	  printf("32F411 - ch9:");
	  VT100CursorGoto(row,25);
	  STAT_print(&st[9]);						// STM32F411re - ch9 - cnts
	  VT100CursorGoto(row,50);
	  STAT_printVolt(&st[9],3.3,4096);			// STM32F411re - ch9 - Volt

	  row++;
	  VT100CursorGoto(row,1);
	  printf("32F411 - ch9 - CPU-T:");
	  VT100CursorGoto(row,50);
	  STAT_printCpuTemperature(&st[9]);			// STM32F411re - Temperatur - deg C

	  row++;
	  VT100CursorGoto(row,1);
	  printf("3204   - ch1:");
	  VT100CursorGoto(row,25);
	  STAT_print(&st3204[1]);					// MCP3204     - ch1 - cnts
	  VT100CursorGoto(row,50);
	  STAT_printVolt(&st3204[1],3.0,4096);		// MCP3204     - ch1 - Volt

	  row++;
	  VT100CursorGoto(row,1);
	  printf("3204   - ch1 - T:");
	  VT100CursorGoto(row,50);
	  STAT_printPT1000Temperature(&st3204[1], uSupp5, 3.0);		// MCP3204     - ch1 - PT1000


	  if (hih8000_status==HAL_OK) {
		  row += 2;
		  VT100CursorGoto(row,1);
		  printf("HIH8000      - RH:");
		  VT100CursorGoto(row,50);
		  printf("%7.1f %%",DAQU_HIH8000_get_RelativeHumidity(&hih8000_result));

